tap "buo/cask-upgrade"
brew "bat"
brew "bottom"
brew "coreutils"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "rg"
brew "fzf"
brew "git-delta"
brew "gitui"
brew "gping"
brew "hyperfine"
brew "neovim"
brew "procs"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "starship"
brew "tealdeer"
brew "yazi"
brew "ffmpeg"
brew "poppler"
brew "resvg"
brew "imagemagick"

brew "zoxide"

# Python development
brew "uv"
brew "direnv"

# Node.js development
brew "nvm"  # Note: Requires special configuration in shell (see .zshrc)

# Development tools for specific languages

# Additional development utilities
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "httpie"         # HTTP client
brew "gh"             # GitHub CLI

cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-google-sans-code"
cask "warp"
cask "maczip"
cask "mos"
cask "squirrel"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
cask "zed"
cask "google-chrome"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "wechat"
cask "neteasemusic"
cask "telegram"
cask "alma"
