tap "buo/cask-upgrade"
brew "basedpyright"
brew "bash-language-server"
brew "bat"
brew "bottom"
brew "coreutils"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git-delta"
brew "gitui"
brew "go"
brew "gopls"
brew "gping"
brew "hyperfine"
brew "neovim"
brew "procs"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yazi"
brew "zoxide"

# Python development
brew "pyenv"
brew "uv"
brew "direnv"

# Node.js development
brew "nvm"

# Development tools for specific languages
brew "black\"          # Python formatter
brew "isort\"          # Python import sorter
brew "prettier\"       # JavaScript/TypeScript formatter
brew "eslint\"         # JavaScript/TypeScript linter
brew "maven\"          # Java build tool
brew "gradle\"         # Java build tool

# Additional development utilities
brew "jq\"             # JSON processor
brew "yq\"             # YAML processor
brew "httpie\"         # HTTP client
brew "gh\"             # GitHub CLI

cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-google-sans-code"
cask "warp"
cask "hiddenbar"
cask "maczip"
cask "mos"
cask "squirrel"
cask "chatwise"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "zed"
cask "orbstack"
cask "sfm"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
