tap "buo/cask-upgrade"
brew "basedpyright"
brew "bash-language-server"
brew "bat"
brew "bottom"
brew "btop"
brew "coreutils"
brew "dockerfile-language-server"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git-delta"
brew "gitui"
brew "go"
brew "gopls"
brew "gping"
brew "hyperfine"
brew "neovim"
brew "procs"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yazi"
brew "zoxide"
cask "captin"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-lxgw-neoxihei"
cask "font-lxgw-wenkai"
cask "font-sf-mono"
cask "hiddenbar"
cask "maczip"
cask "mos"
cask "squirrel"
